[
  {
    "type": "INTJ",
    "name": "Architect",
    "description": "People with the Architect personality type focus much of their energy on strategy and getting things done well.",
    "suggested_starting_place": "Personality Type and Love Language: Architects (INTJ)."
  },
  {
    "type": "INTP",
    "name": "Logician",
    "description": "Logicians are more likely than other personality types to report that they struggle with trust, sacrifice, giving, and belonging.",
    "suggested_starting_place": "11 Ways Turbulent Introverts Can Build Confidence and Sociability."
  },
  {
    "type": "ENTJ",
    "name": "Commander",
    "description": "Commanders see themselves as less sensitive than most other personality types to other people’s needs and feelings.",
    "suggested_starting_place": "Asking for Help Part II: Some Stories Personality Types Tell Themselves."
  },
  {
    "type": "ENTP",
    "name": "Debater",
    "description": "Debaters are often in a state of flux and uncertainty.",
    "suggested_starting_place": "Putting It Off No More: Procrastination and Personality."
  },
  {
    "type": "INFJ",
    "name": "Advocate",
    "description": "Advocates are generally concerned with ensuring that people are all right and treated fairly.",
    "suggested_starting_place": "What Are the Biggest Sources of Stress for Advocates (INFJs)?"
  },
  {
    "type": "INFP",
    "name": "Mediator",
    "description": "Mediators are sensitive, warm people who care about others.",
    "suggested_starting_place": "Mediators (INFP) and Self-Talk: Transforming Negativity into Creative Opportunities."
  },
  {
    "type": "ENFJ",
    "name": "Protagonist",
    "description": "Protagonists are protectors. They care about the welfare of others.",
    "suggested_starting_place": "“I Don’t Want to Hear It”: Compassion Fatigue and Feeling Personality Types."
  },
  {
    "type": "ENFP",
    "name": "Campaigner",
    "description": "Campaigners are more likely than most personalities to desire opportunities to be spontaneous, explore novelty, and follow their feelings.",
    "suggested_starting_place": "Campaigner (ENFP) Productivity Tips: Results and Relationships."
  },
  {
    "type": "ISTJ",
    "name": "Logistician",
    "description": "Logisticians like things to be orderly and reasonable. They have little tolerance for things being disorganized or, in their opinion, nonsensical.",
    "suggested_starting_place": "Understanding Forgiveness through the Lens of Personality Type."
  },
  {
    "type": "ISFJ",
    "name": "Defender",
    "description": "Defenders are detail-oriented and exacting, mostly of themselves.",
    "suggested_starting_place": "Defenders (ISFJ) and Mental Load: Holding It All Together."
  },
  {
    "type": "ESTJ",
    "name": "Executive",
    "description": "Executives are vigorously hands-on in life, whether accomplishing a task themselves or leading others.",
    "suggested_starting_place": "Personality Types, Emotional Intelligence (EQ), and the Workplace."
  },
  {
    "type": "ESFJ",
    "name": "Consul",
    "description": "It’s too easy to think of Consuls as the creators of celebrations and the reliable ones in any group.",
    "suggested_starting_place": "“I’m Not Stubborn, I’m Persistent”: Stubbornness and Personality Types."
  },
  {
    "type": "ISTP",
    "name": "Virtuoso",
    "description": "Virtuosos are the quiet doers. They place a lot of value on the things that allow them to feel proficient.",
    "suggested_starting_place": "Is It Okay to Be an Unsociable Personality?"
  },
  {
    "type": "ISFP",
    "name": "Adventurer",
    "description": "Adventurers tend to be humble and sensitive individuals.",
    "suggested_starting_place": "Finding Your Life Purpose If You’re an Explorer."
  },
  {
    "type": "ESTP",
    "name": "Entrepreneur",
    "description": "If Entrepreneurs are nearby, hang on to your metaphorical hat.",
    "suggested_starting_place": "Prospecting Personality Types: Adulting Superpowers and Projects."
  },
  {
    "type": "ESFP",
    "name": "Entertainer",
    "description": "Life is a cabaret, or so the old song says. Entertainers likely agree.",
    "suggested_starting_place": "Building Financial Literacy According to Personality Type."
  }
]

